Autodesk.Revit.DB.PrimarySizeCriterion.None
Creates a criterion with a range of no sizes.
Returns:
The new criterion.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.All
Creates a criterion with a range of all sizes.
Returns:
The new criterion.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.MaximumSize
The maximum size of this criterion.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.MinimumSize
The minimum size of this criterion.
Since:
2013